posts/advanced-features/with-xml-samples/AirShoppingRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:get="http://www.iata.org/IATA/EDIST/2017.2">
    <soapenv:Header/>
    <soapenv:Body>
        <AirShoppingRQ Version="17.2" PrimaryLangID="EN" AltLangID="EN" xmlns="http://www.iata.org/IATA/EDIST/2017.2">
            <Document>
                <Name>BA</Name>
            </Document>
            <Party>
                <Sender>
                    <TravelAgencySender>
                        <IATA_Number>000000</IATA_Number>
                        <AgencyID>Test_Agent</AgencyID>
                    </TravelAgencySender>
                </Sender>
            </Party>
            <CoreQuery>
                <OriginDestinations>
                    <OriginDestination>
                        <Departure>
                            <AirportCode>LHR</AirportCode>
                            <Date>2018-10-15</Date>
                        </Departure>
                        <Arrival>
                            <AirportCode>JFK</AirportCode>
                        </Arrival>
                        <CalendarDates DaysBefore="3" DaysAfter="3"/>
                    </OriginDestination>
                </OriginDestinations>
            </CoreQuery>
            <Preference>
                <FarePreferences>
                    <Types>
                        <Type>759</Type>
                    </Types>
                </FarePreferences>
                <FlightPreferences>
                    <Characteristic>
                        <DirectPreferences/>
                    </Characteristic>
                </FlightPreferences>
                <CabinPreferences>
                    <CabinType>
                        <Code>5</Code>
                    </CabinType>
                </CabinPreferences>
            </Preference>
            <DataLists>
                <PassengerList>
                    <Passenger PassengerID="T1">
                        <PTC>ADT</PTC>
                        <Individual>
                            <Birthdate>1970-01-01</Birthdate>
                            <Gender>Male</Gender>
                            <NameTitle>Mr</NameTitle>
                            <GivenName>Frequent</GivenName>
                            <Surname>Flyer</Surname>
                        </Individual>
                        <LoyaltyProgramAccount>
                            <Airline>
                                <AirlineDesignator>BA</AirlineDesignator>
                            </Airline>
                            <AccountNumber>12345678</AccountNumber>
                        </LoyaltyProgramAccount>
                    </Passenger>
                    <Passenger PassengerID="T2">
                        <PTC>ADT</PTC>
                        <Birthdate>2006-02-18</Birthdate>
                    </Passenger>
                    <Passenger PassengerID="T3">
                        <PTC>CHD</PTC>
                    </Passenger>
                    <Passenger PassengerID="T4">
                        <PTC>INF</PTC>
                    </Passenger>
                </PassengerList>
            </DataLists>
        </AirShoppingRQ>
    </soapenv:Body>
  </soapenv:Envelope>